tap "brewsci/science"
tap "gromgit/fuse"
tap "krishkrosh/apps"
tap "mhaeuser/mhaeuser"
tap "mongodb/brew"
tap "sidneys/homebrew"
brew "lz4"
brew "xz"
brew "openssl@3"
brew "aria2"
brew "autoconf"
brew "automake"
brew "bison"
brew "boost"
brew "cabextract"
brew "cairo"
brew "cdrtools"
brew "gcc"
brew "gflags"
brew "glog"
brew "pkgconf"
brew "cmake"
brew "cowsay"
brew "cpptoml"
brew "create-dmg"
brew "dlib"
brew "double-conversion"
brew "fast_float"
brew "fastfetch"
brew "libevent"
brew "libarchive"
brew "snappy"
brew "ffmpeg"
brew "flex"
brew "fmt"
brew "fortune"
brew "libtool"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "git"
brew "git-filter-repo"
brew "imagemagick"
brew "inetutils"
brew "jemalloc"
brew "python@3.14"
brew "llvm"
brew "lolcat"
brew "make"
brew "openjdk"
brew "maven"
brew "node"
brew "nasm"
brew "nlohmann-json"
brew "opencv"
brew "openjdk@21"
brew "php"
brew "portaudio"
brew "python@3.10"
brew "python-tk@3.10"
brew "python@3.13"
brew "python-tk@3.13"
brew "python-tk@3.14"
brew "qt@5"
brew "sl"
brew "wimlib"
brew "mongodb/brew/mongodb-community@7.0"
cask "alt-tab"
cask "android-platform-tools"
cask "battery-toolkit"
cask "chromedriver"
cask "github-copilot-for-xcode"
cask "mkvtoolnix-app"
cask "scroll-reverser"
cask "stats"
cask "whisky"
