tap "brewsci/science"
tap "gromgit/fuse"
tap "homebrew/services"
tap "krishkrosh/apps"
tap "mhaeuser/mhaeuser"
tap "mongodb/brew"
tap "sidneys/homebrew"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Vector graphics library with cross-device output support
brew "cairo"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# GNU compiler collection
brew "gcc"
# Library for processing command-line flags
brew "gflags"
# Application-level logging library
brew "glog"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Cross-platform make
brew "cmake"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Header-only library for parsing TOML
brew "cpptoml"
# Shell script to build fancy DMGs
brew "create-dmg"
# C++ library for machine learning
brew "dlib"
# Binary-decimal and decimal-binary routines for IEEE doubles
brew "double-conversion"
# Fast and exact implementation of the C++ from_chars functions for number types
brew "fast_float"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Asynchronous event library
brew "libevent"
# Multi-format archive and compression library
brew "libarchive"
# Compression/decompression library aiming for high speed
brew "snappy"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Open-source formatting library for C++
brew "fmt"
# Infamous electronic fortune-cookie generator
brew "fortune"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Utility for directing compilation
brew "make"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Platform built on V8 to build network applications
brew "node"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# JSON for modern C++
brew "nlohmann-json"
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk@21"
# Cross-platform library for audio I/O
brew "portaudio"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Cross-platform application and UI framework
brew "qt@5"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@7.0"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# Control the platform power state of your Apple Silicon device
cask "battery-toolkit"
# Xcode asset catalog creator
cask "iconizer"
# Set of tools to create, alter and inspect Matroska files (MKV)
cask "mkvtoolnix-app"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# System monitor for the menu bar
cask "stats"
# Wine wrapper built with SwiftUI
cask "whisky"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "usernamehw.indent-one-space"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
